[
    {
        "name": "Astrid",
        "power": "Attack +1",
        "description": "For each figure you control, roll one extra attack die",
        "duration": "Permanent"
    },
    {
        "name": "Brandar",
        "power": "Artifact",
        "description": "The rules for this Glyph vary, depending on the Game Scenario.",
        "duration": ""
    },
    {
        "name": "Dagmar",
        "power": "Initiative +8",
        "description": "When you roll for initiative, add 8 to your die roll.",
        "duration": "Permanent"
    },
    {
        "name": "Erland",
        "power": "Summoning",
        "description": "When one of your figures stops here, you may \"summon\" any other figure (yours or your opponent's) by moving it to a space adjacent to the figure on the Glyph. The summoned figure does not receive a leaving engagement roll if it was engaged. Note: If there is no empty adjacent space, you can't use the Summon power.",
        "duration": "Temporary"
    },
    {
        "name": "Gerda",
        "power": "Defense +1",
        "description": "For each figure you control, roll one extra defense die.",
        "duration": "Permanent"
    },
    {
        "name": "Ivor",
        "power": "Range +4",
        "description": "For each figure you control with a Range number of 4 or more, add 4 to the Range number.",
        "duration": "Permanent"
    },
    {
        "name": "Kelda",
        "power": "Healer",
        "description": "Only figures with one or more Wound Markers may stop on this Glyph. When one of your figures stops here, remove all Wound Markers from its Army Card. This Glyph cannot be placed symbol‑side up in any scenario you may create.",
        "duration": "Temporary"
    },
    {
        "name": "Mitonsoul",
        "power": "Massive Curse",
        "description": "For each figure on the battlefield (yours and your opponents'), roll the 20‑sided die. If you roll 1, the figure is destroyed. If you roll 2 through 20, the figure is safe.",
        "duration": "Temporary"
    },
    {
        "name": "Valda",
        "power": "Move +2",
        "description": "For each figure you control, add 2 to the Move number. (Do not use this power when moving off of the Glyph.)",
        "duration": "Permanent"
    },
    {
        "name": "Sturla",
        "power": "Revive",
        "description": "One at a time, roll the 20‑sided die for each figure destroyed in this battle (your's, your teammates' and your opponents'). If you roll a 19 or 20, place the figure in any starting zone of your choice. If you roll 1 through 18, the figure remains destroyed.",
        "duration": "Temporary"
    },
    {
        "name": "Jalgard",
        "power": "Defense +2",
        "description": "For each of your figures, roll two extra defense dice.",
        "duration": "Permanent"
    },
    {
        "name": "Rannveig",
        "power": "Wind",
        "description": "All figures with the Flying special power lose this power and cannot fly while standing on the Glyph of Rannveig.",
        "duration": "Permanent"
    },
    {
        "name": "Lodin",
        "power": "Lucky Twenty‑Sider",
        "description": "Any time you roll the 20‑sided die while standing on the Glyph of Lodin, you may add one to your die roll.",
        "duration": "Permanent"
    },
    {
        "name": "Crevcor",
        "power": "Common Attack +1",
        "description": "All common figures in your Army may add one extra attack die when attacking normally.",
        "duration": "Permanent"
    },
    {
        "name": "Nilrend",
        "power": "Negation",
        "description": "When one of your figures stops here, you may choose any opponent's unique figure. Roll the 20-sided die. If you role a 1 - 4, nothing happens. If you roll a 5 - 20, place the Gold Negation Marker on the chosen figure's Army Card. All of that figure's special powers are negated for the rest of the game.",
        "duration": "Temporary"
    },
    {
        "name": "Oreld",
        "power": "Intercept Order",
        "description": "When one of your figures stops here, roll the 20-sided die. If you role a 1 - 9, nothing happens. If you roll a 10 - 20, you may remove one random Order Marker from an opponent's Army Card.",
        "duration": "Temporary"
    },
    {
        "name": "Proftaka",
        "power": "Pit Trap",
        "description": "Your figure is trapped. The trapped figure cannot move from this space. The figure can move off the Glyph of Praftaka only if a friendly figure occupies an adjacent space.",
        "duration": "Permanent"
    },
    {
        "name": "Thorian",
        "power": "Thorian",
        "description": "All opponents' figures must be adjacent to your figures to attack your figures with a normal attack.",
        "duration": "Permanent"
    },
    {
        "name": "Ulaniva",
        "power": "Unique Attack +1",
        "description": "All unique figures in your Army may add one extra attack die when attacking normally.",
        "duration": "Permanent"
    },
    {
        "name": "Wannok",
        "power": "Wound",
        "description": "At the end of every round, roll the 20-sided die. If you roll a 1, the figure on the Glyph receives one wound. If you roll a 2 or higher, you may choose an opponent who must give one wound to any figure he or she controls on the battlefield.",
        "duration": "Permanent"
    },
    {
        "name": "Brandar's Chest",
        "power": "Artifact",
        "description": "The rules for this Treasure Glyph vary, depending on the Game Scenario.",
        "duration": ""
    },
    {
        "name": "Potion of Healing",
        "power": "Heal 3 Wounds",
        "description": "This figure may drink this potion after revealing an order marker on its Army Card. Remove up to 3 wound markers from that figure's Army Card.",
        "duration": "Temporary"
    },
    {
        "name": "Talisman of Defense",
        "power": "Defense +1",
        "description": "This figure adds 1 additional defense die when defending.",
        "duration": "Permanent"
    },
    {
        "name": "Heroic Rune",
        "power": "Attack +1",
        "description": "This figure adds 1 additional attack die when making a normal attack.",
        "duration": "Permanent"
    },
    {
        "name": "Bolt of the Witherwood",
        "power": "Destroy 16",
        "description": "Ancient Artifact. After moving and before attacking with this figure, you may choose any opponent's figure within 5 clear sight spaces. Roll the 20-sided die. If you roll a 1-15, nothing happens. If you roll a 16 or higher, the chosen figure is destroyed.",
        "duration": "Temporary"
    },
    {
        "name": "Ring of Protection",
        "power": "Defense +3",
        "description": "This figure may use this ring after an opponent has rolled attack dice for a normal or special attack against it, and before rolling defense dice. When rolling defense dice against that attack, this figure adds 3 additional dice.",
        "duration": "Temporary"
    },
    {
        "name": "Elixir of Speed",
        "power": "Move +4",
        "description": "This figure may drink this elixir before moving. This figure adds 4 to its Move value this turn.",
        "duration": "Temporary"
    },
    {
        "name": "Whetstone of Venom",
        "power": "Poison",
        "description": "This figure may use this whetstone before rolling attack dice for a normal attack against an adjacent figure. If that attack inflicts at least 1 wound, you may add 2 additional wound markers to the defending figure's Army Card.",
        "duration": "Temporary"
    },
    {
        "name": "Holy Symbol of Pelor",
        "power": "Attack +2 vs. Undead",
        "description": "This figure adds 2 additional attack dice when attacking an Undead figure with a normal attack.",
        "duration": "Permanent"
    },
    {
        "name": "Bracers of Teleportation",
        "power": "Teleportation",
        "description": "This figure may use these bracers before moving. Instead of moving normally, you may place this figure on any same-level space(s) within 10 spaces of its current location. If this figure is engaged when it starts to teleport, it will not take any leaving engagement attacks.",
        "duration": "Temporary"
    },
    {
        "name": "Temporary",
        "power": "Invisibility",
        "description": "This figure may use this cloak at any point during its turn. This figure has no visible Hit Zones until the end of the current round or until it attacks with a normal or special attack, whichever comes first. This figure will never take any leaving engagement attacks while invisible.",
        "duration": "Temporary"
    },
    {
        "name": "Belt of Giant Strength",
        "power": "Attack +2",
        "description": "This figure may use this belt before rolling attack dice for a normal attack against an adjacent figure. This figure adds 2 additional dice when attacking with a normal attack this turn.",
        "duration": "Temporary"
    },
    {
        "name": "Brooch of Shielding",
        "power": "Disengage",
        "description": "This figure is never attacked when leaving an engagement.",
        "duration": "Permanent"
    },
    {
        "name": "This figure is never attacked when leaving an engagement.",
        "power": "+1 vs. Large or Huge",
        "description": "This figure rolls an additional die when attacking or defending against large or huge figures.",
        "duration": "Permanent"
    },
    {
        "name": "Scarab of Invulnerability",
        "power": "Ignore Wounds",
        "description": "This figure may use this scarab whenever it receives one or more wounds. Roll the 20-sided die. If you roll a 1-15, ignore one of the wounds just received. If you roll a 16 or higher, ignore all wounds just received.",
        "duration": "Temporary"
    },
    {
        "name": "Oceanstrider Amulet",
        "power": "Waterwalking",
        "description": "This figure does not have to stop its movement when entering water spaces.",
        "duration": "Permanent"
    },
    {
        "name": "Revenant’s Tome",
        "power": "Unnatural Revival",
        "description": "Ancient Artifact. This figure may use this tome after revealing an order marker on its Army Card. Before taking that turn with this figure, place one previously destroyed Unique figure from your Army onto any empty space(s) within 5 clear sight spaces of this figure. Immediately make a normal attack with the placed figure, then destroy the placed figure immediately afterward. While the placed figure is on the battlefield, all of its special powers are considered to be negated. The placed figure is considered to have a Life of 1, and is not affected by any special powers on any Army Card or Glyph while on the battlefield.",
        "duration": "Temporary"
    }
]

